
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.УникальныйИдентификатор = "" Тогда
		Элементы.ПраваДоступа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ВсеРоли = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Объект.УникальныйИдентификатор)).Роли;
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		
		НоваяРоль = СписокРолей.Добавить();
		НоваяРоль.Наименование = Роль.ПолноеИмя();
		НоваяРоль.Установлена = ВсеРоли.Содержит(Роль);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.УникальныйИдентификатор = "" Тогда
		Элементы.ПраваДоступа.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
